Tekla Open API Reference for Tekla Structures 2025
IPlacing Methods
Methods
Name | Description
GetObjects()
 Gets the children of the current object.
 (Inherited from IHasChildren.)
GetObjects(Type[])
 Gets the children of the current object that are of certain types.
 (Inherited from IHasChildren.)
Top
See Also
Reference
IPlacing Interface
Tekla.Structures.Drawing Namespace